feat(docs): added web page for documentation surfing
